binsec/rtas2021_artifact/unisim/unisim_simulators/tlm2/mpc5777m/soft/libsys/src/drv/dmamux.c
/*
 *  Copyright (c) 2017,
 *  Commissariat a l'Energie Atomique (CEA)
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *   - Redistributions of source code must retain the above copyright notice, this
 *     list of conditions and the following disclaimer.
 *
 *   - Redistributions in binary form must reproduce the above copyright notice,
 *     this list of conditions and the following disclaimer in the documentation
 *     and/or other materials provided with the distribution.
 *
 *   - Neither the name of CEA nor the names of its contributors may be used to
 *     endorse or promote products derived from this software without specific prior
 *     written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 *  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 *  WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 *  DISCLAIMED.
 *  IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 *  INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 *  BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
 *  OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 *  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 *  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * Authors: Gilles Mouchard (gilles.mouchard@cea.fr)
 */

#include "dmamux.h"
#include "MPC5777M.h"
#include "compiler_api.h"

static volatile struct DMAMUX_tag *dmamux[10];

void dmamux_drv_init()
{
	dmamux[0] = &DMAMUX_0;
	dmamux[1] = &DMAMUX_1;
	dmamux[2] = &DMAMUX_2;
	dmamux[3] = &DMAMUX_3;
	dmamux[4] = &DMAMUX_4;
	dmamux[5] = &DMAMUX_5;
	dmamux[6] = &DMAMUX_6;
	dmamux[7] = &DMAMUX_7;
	dmamux[8] = &DMAMUX_8;
	dmamux[9] = &DMAMUX_9;
}

void dmamux_init(unsigned int dmamux_id)
{
}

void dmamux_enable_dma_channel(unsigned int dmamux_id, unsigned int chan)
{
	dmamux[dmamux_id]->CHCFG[chan].B.ENBL = 1;
}

void dmamux_disable_dma_channel(unsigned int dmamux_id, unsigned int chan)
{
	dmamux[dmamux_id]->CHCFG[chan].B.ENBL = 0;
}

void dmamux_enable_dma_channel_trigger(unsigned int dmamux_id, unsigned int chan)
{
	dmamux[dmamux_id]->CHCFG[chan].B.TRIG = 1;
}

void dmamux_disable_dma_channel_trigger(unsigned int dmamux_id, unsigned int chan)
{
	dmamux[dmamux_id]->CHCFG[chan].B.TRIG = 0;
}

void dmamux_set_dma_channel_source(unsigned int dmamux_id, unsigned int chan, unsigned int src)
{
	dmamux[dmamux_id]->CHCFG[chan].B.SOURCE = src;
}
